/*Завдання 1
Натискання на кнопку "SHOW ME" має виводити значення з поля введення e консоль  (дивіться на елементи в html-розмітці)
*/

/*
Завдання 2
Після натискання кнопки "SWAP ME" здійснюється обмін вмістом між двома інпутами.
Ви можете натиснути на неї кілька разів або вручну змінити вміст інпутів.
*/

/*Завдання 3
Кнопка "Приховати" ховає текст і замінює назву кнопки на
"Розкрити", при повторному натисканні текст знову стає доступним
і кнопка набуває початкового вигляду.
*/

/*
Завдання 4
Кнопка "Зменшити" робить квадрат менше на 10 пікселів, допопка "Збільшити" - більше на 10 пікселів.
https://developer.mozilla.org/en-US/docs/Web/API/Window/getComputedStyle
*/
/*
Завдання 5
Додайде слухач кліку і визначте, коли клік відбувається
всередині елемента з id "place" і коли клік припадає поза зоною елемента
https://developer.mozilla.org/en-US/docs/Web/API/Node/contains
*/
/*
Завдання 6
Натиснувши кнопку "Подвоювати", збільшити значення
у кожному елементі списку у 2 рази
*/
/*
Завдання 7
При натисканні на коло він повинен слідувати за курсором.
При повторному натисканні він стає в початкове положення.
https://developer.mozilla.org/en-US/docs/Web/API/MouseEvent/MouseEvent
https://developer.mozilla.org/ru/docs/Web/API/MouseEvent/pageX
https://developer.mozilla.org/en-US/docs/Web/API/MouseEvent/pageY
*/
/*
Завдання 8
При натисканні на кожну з кнопок підсумовуються значення з data-атрибутів.
За натисканням на кнопку "Вивести результат" виводиться сума значення, а також статистика з
інформацією про те, яка кнопка була натиснута скільки разів.
*/
/*
Завдання 9
Видалити зі списку елементи, які позначені.
*/

/*
Завдання 10
Наведено список людей. Зроби можливість сортування списку на ім'я та на прізвище.
*/

/*
Завдання 11
Наведено список людей. Зроби фільтр на ім'я/прізвище.
*/

/*
Завдання 12
Клік по кнопці замінює символ першого поля введення
символ з другого поля введення в усьому тексті.
Якщо одне з полів порожнє, викликай alert із проханням заповнити їх.
*/

/*
Завдання 13
Коло має зникати при наведенні на нього.
При цьому позиція сусідніх кіл має залишатися незмінною.
*/


/*
Завдання 14
Написати функцію, яка буде створювати список подій клавіатури event.key та event.code
Додати класи на список eventList, на елементи eventCode та eventKey
*/

/*Завдання 15
Взяти попереднє завдання з Зоопарком та вивести звірів, їх тип та особливості в DOM.
Додати до списку клас animalList.На елемент списку animalElement
*/
/*
Завдання 16
 Створіть HTML сторінку з табличкою,
 яка містить список продуктів.Кожен рядок у
 табличці повинен містити назву продукту та його ціну.
 При натисканні на будь - який рядок у табличці відобразіть
 повідомлення з назвою продукту та його ціною.
*/
/*Завдання 17
Створіть HTML сторінку з формою,
яка містить поле введення для введення
імені користувача та кнопку.При натисканні
на кнопку відобразіть повідомлення з привітанням з іменем користувача.
*/
